blog/org-info/emacs_com/emacs_graphviz-mode.org
#+TITLE: artist mode && graphviz mode
#+INFOJS_OPT: path:../script/org-info.js
#+INFOJS_OPT: toc:t ltoc:t
#+INFOJS_OPT: view:info mouse:underline buttons:nil

emacs绘图mode, artist-mode && graphviz-mode

* 为什么需要artist-mode && graphviz-mode
  图形表达更直观, 形象.
  
* 什么是artist-mode && graphviz-mode
  两者都是emacs上的绘图mode

  | mode          | 简述      | 优点                          | 缺点                                      |
  |---------------+-----------+-------------------------------+-------------------------------------------|
  | artist-mode   | ASCII绘图 | 1.ASCII代码表示图形           | 1.功能少                                  |
  |               |           | 2.短小精悍                    | 2.需要手动绘制图形                        |
  |---------------+-----------+-------------------------------+-------------------------------------------|
  | graphviz-mode | dot绘图   | 1.只关注逻辑设计,布局自动生成 | 1.生成的为图片文件, 而非可嵌入的ASCII代码 |
  |               |           |                               | 2.需要学习dot语言                         |
  |---------------+-----------+-------------------------------+-------------------------------------------|
* artist-mode
** 配置
   emacs自带, 无需额外配置
** 使用
   1. 具体使用方法: "C-h f artist-mode"可查看详细文档
   2. 默认 常用方法: 
     | 图形      | 简述     | 命令      | 备注       |
     |-----------+----------+-----------+------------|
     | line      | 线段     | C-c C-a l |            |
     |-----------+----------+-----------+------------|
     | proy line | 直线     | C-c C-a p |            |
     |-----------+----------+-----------+------------|
     | 四边形    | rectngle | C-c C-a r |            |
     |-----------+----------+-----------+------------|
     | 正方形    | squares  | C-c C-a s |            |
     |-----------+----------+-----------+------------|
     | 椭圆      | elipse   | C-c C-a e |            |
     |-----------+----------+-----------+------------|
     | 圆        | circle   | C-c C-a c |            |
     |-----------+----------+-----------+------------|
     | 水雾      | spray    | C-c C-a S |            |
     |-----------+----------+-----------+------------|
     | 开始绘图  |          | C-@       | 自定义按键 |
     |-----------+----------+-----------+------------|
   3. 改键(Hydra-mode)后快捷键 C-@
      : 强推Hydra-mode用来改建
      #+BEGIN_EXAMPLE
      (require 'artist)
      (defhydra hydra-artist-mode (:color blue
      :hint nil)
      "
      _o_: 起点,终点
      _l_: 线      _p_: 直线
      _r_: 四边形  _s_: 正方形
      _e_: 椭圆    _c_: 圆
      _y_: 水雾
      "
      ("o" artist-key-set-point)
 
      ("l" artist-select-op-line)
      ("p" artist-select-op-poly-line)
 
      ("r" artist-select-op-rectangle)
      ("s" artist-select-op-square)
 
      ("e" artist-select-op-ellipse)
      ("c" artist-select-op-circle)
 
      ("y" artist-select-op-spray-can))
      (global-set-key (kbd "C-@")  'hydra-artist-mode/body)
      #+END_EXAMPLE

* graphviz-mode
** 配置
   1. Emacs安装graphviz-dot-mode 
      : package-list-packages
   2. 操作系统安装graphviz
      : mac下安装 brew install graphviz
** 使用
   1. 创建.dot (或者org)文件
   2. 输入"The DOT Language"代码
   3. 输入命令: graphviz-dot-preview即可查看到图片
** The DOT Language
   [[http://users.skynet.be/ppareit/projects/graphviz-dot-mode/graphviz-dot-mode.html][官方文档]]
   [[https://blog.csdn.net/sd10086/article/details/52979462][语法参考文档]]
   
   DOT中使用图(digraph/graph), 节点(node)和边(edge)来描述关系和流程图.
*** 图
    - 有向图 digraph
    - 无向图 graph
    - 子图 subgraph
      : 可以进行和“父图”类似的设置，唯一注意的是子图必须以cluster做为名称的前缀

    在图的开头使用graph []对图进行设置，如：graph [bgcolor="gray"]将图背景色设置为灰色。
    属性设置语句也可以不包含在graph []中而直接使用。
    | 属性名称  | 默认值      | 含义                          | 备注                         |
    |-----------+-------------+-------------------------------+------------------------------|
    | color     | black       | 颜色                          | 支持如red和#FF00000两种形式  |
    |-----------+-------------+-------------------------------+------------------------------|
    | fontcolor | black       | 文本颜色                      |                              |
    |-----------+-------------+-------------------------------+------------------------------|
    | fontsiez  | 14          | 字体大小                      |                              |
    |-----------+-------------+-------------------------------+------------------------------|
    | label     |             | 显示的标签                    | 对于节点, 默认为节点名称     |
    |-----------+-------------+-------------------------------+------------------------------|
    | style     |             | 样式                          |                              |
    |-----------+-------------+-------------------------------+------------------------------|
    |-----------+-------------+-------------------------------+------------------------------|
    | bgcolor   |             | 背景颜色                      |                              |
    |-----------+-------------+-------------------------------+------------------------------|
    | nodesep   | .25         | 节点间隔(英寸)                |                              |
    |-----------+-------------+-------------------------------+------------------------------|
    | rank      |             | 节点顺序                      | same, min, source, max, sink |
    |-----------+-------------+-------------------------------+------------------------------|
    | rankdir   | TB          | 排序方向                      | TB(top->bottom)              |
    |-----------+-------------+-------------------------------+------------------------------|
    | size      |             | 图的大小                      |                              |
    |-----------+-------------+-------------------------------+------------------------------|
    | labelloc  |             | 调整图或子图的 标签的上下位置 |                              |
    |-----------+-------------+-------------------------------+------------------------------|
    | labeljust |             | 调整图或子图的 标签的左右位置 |                              |
    |-----------+-------------+-------------------------------+------------------------------|

*** 节点
    DOT中，节点可以不用声明直接使用，但如果需要设置节点的属性，则需声明节点并在声明处设
    置属性然后再使用。每个节点首次出现的名称做为该节点的唯一标识
    
    node []用于设置节点默认属性（对设置位置之后的点有效），在节点后面用[]设置单独一个点的属性。
    | 属性名称  | 默认值          | 含义                 | 备注                        |
    |-----------+-----------------+----------------------+-----------------------------|
    | color     | black           | 颜色                 | 支持如red和#FF00000两种形式 |
    |-----------+-----------------+----------------------+-----------------------------|
    | fontcolor | black           | 文本颜色             |                             |
    |-----------+-----------------+----------------------+-----------------------------|
    | fontsiez  | 14              | 字体大小             |                             |
    |-----------+-----------------+----------------------+-----------------------------|
    | label     |                 | 显示的标签           | 对于节点, 默认为节点名称    |
    |-----------+-----------------+----------------------+-----------------------------|
    | style     |                 | 样式                 |                             |
    |-----------+-----------------+----------------------+-----------------------------|
    |-----------+-----------------+----------------------+-----------------------------|
    | shape     | ellipse         | 节点形状             |                             |
    |-----------+-----------------+----------------------+-----------------------------|
    | fillcolor | lightgrey/black | 节点填充颜色         |                             |
    |-----------+-----------------+----------------------+-----------------------------|
    | fixedsize | false           | 标签是否影响节点大小 |                             |
    |-----------+-----------------+----------------------+-----------------------------|
*** 边
    DOT中有有向边（使用->表示）和无向边（使用--表示）两种，有向边用于有向图，无向边用于无向图，不可混用。
    
    和节点类似的，用edge []设置边默认属性，在边之后用[]设置单独一条边的属性。
    对于有向边，还可以设置边的起点/终点的位置（用n、e、s、w或它们的组合表示位置）。
    | 属性名称   | 默认值  | 含义                                | 备注                        |
    |------------+---------+-------------------------------------+-----------------------------|
    | color      | black   | 颜色                                | 支持如red和#FF00000两种形式 |
    |------------+---------+-------------------------------------+-----------------------------|
    | fontcolor  | black   | 文本颜色                            |                             |
    |------------+---------+-------------------------------------+-----------------------------|
    | fontsiez   | 14      | 字体大小                            |                             |
    |------------+---------+-------------------------------------+-----------------------------|
    | label      |         | 显示的标签                          | 对于节点, 默认为节点名称    |
    |------------+---------+-------------------------------------+-----------------------------|
    | style      |         | 样式                                |                             |
    |------------+---------+-------------------------------------+-----------------------------|
    |------------+---------+-------------------------------------+-----------------------------|
    | arrowhead  | normal  | 箭头头部形状                        |                             |
    |------------+---------+-------------------------------------+-----------------------------|
    | arrowtail  | normal  | 箭头尾部形状                        |                             |
    |------------+---------+-------------------------------------+-----------------------------|
    | constraint | ture    | 是否根据边来影响节点的排序          |                             |
    |------------+---------+-------------------------------------+-----------------------------|
    | decorate   |         | 设置之后会用一条线来连接edge和label |                             |
    |------------+---------+-------------------------------------+-----------------------------|
    | dir        | forward | 边的设置方向                        | forward,bcak,both,none      |
    |------------+---------+-------------------------------------+-----------------------------|
    | headlabel  |         | 边的头部显示的标签                  |                             |
    |------------+---------+-------------------------------------+-----------------------------|
    | taillabel  |         | 边的尾部显示的标签                  |                             |
    |------------+---------+-------------------------------------+-----------------------------|

