org-info/emacs_com/emacs_graphviz-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-30 Thu 23:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>artist mode &amp;&amp; graphviz mode</title>
<meta name="generator" content="Org mode" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../emacs.html"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">artist mode &amp;&amp; graphviz mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga923fcc">1. 为什么需要artist-mode &amp;&amp; graphviz-mode</a></li>
<li><a href="#org854e52d">2. 什么是artist-mode &amp;&amp; graphviz-mode</a></li>
<li><a href="#orgf16a2da">3. artist-mode</a>
<ul>
<li><a href="#orgf5cda9b">3.1. 配置</a></li>
<li><a href="#org0c1ffba">3.2. 使用</a></li>
</ul>
</li>
<li><a href="#org5b8cc5d">4. graphviz-mode</a>
<ul>
<li><a href="#org1e8c9c0">4.1. 配置</a></li>
<li><a href="#org3b2919e">4.2. 使用</a></li>
<li><a href="#org9ef89cd">4.3. The DOT Language</a>
<ul>
<li><a href="#org7ef7a70">4.3.1. 图</a></li>
<li><a href="#orge918467">4.3.2. 节点</a></li>
<li><a href="#org84db21e">4.3.3. 边</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
emacs绘图mode, artist-mode &amp;&amp; graphviz-mode
</p>

<div id="outline-container-orga923fcc" class="outline-2">
<h2 id="orga923fcc"><span class="section-number-2">1</span> 为什么需要artist-mode &amp;&amp; graphviz-mode</h2>
<div class="outline-text-2" id="text-1">
<p>
图形表达更直观, 形象.
</p>
</div>
</div>

<div id="outline-container-org854e52d" class="outline-2">
<h2 id="org854e52d"><span class="section-number-2">2</span> 什么是artist-mode &amp;&amp; graphviz-mode</h2>
<div class="outline-text-2" id="text-2">
<p>
两者都是emacs上的绘图mode
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">mode</th>
<th scope="col" class="org-left">简述</th>
<th scope="col" class="org-left">优点</th>
<th scope="col" class="org-left">缺点</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">artist-mode</td>
<td class="org-left">ASCII绘图</td>
<td class="org-left">1.ASCII代码表示图形</td>
<td class="org-left">1.功能少</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">2.短小精悍</td>
<td class="org-left">2.需要手动绘制图形</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">graphviz-mode</td>
<td class="org-left">dot绘图</td>
<td class="org-left">1.只关注逻辑设计,布局自动生成</td>
<td class="org-left">1.生成的为图片文件, 而非可嵌入的ASCII代码</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">2.需要学习dot语言</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgf16a2da" class="outline-2">
<h2 id="orgf16a2da"><span class="section-number-2">3</span> artist-mode</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf5cda9b" class="outline-3">
<h3 id="orgf5cda9b"><span class="section-number-3">3.1</span> 配置</h3>
<div class="outline-text-3" id="text-3-1">
<p>
emacs自带, 无需额外配置
</p>
</div>
</div>
<div id="outline-container-org0c1ffba" class="outline-3">
<h3 id="org0c1ffba"><span class="section-number-3">3.2</span> 使用</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li>具体使用方法: "C-h f artist-mode"可查看详细文档</li>
<li><p>
默认 常用方法: 
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">图形</th>
<th scope="col" class="org-left">简述</th>
<th scope="col" class="org-left">命令</th>
<th scope="col" class="org-left">备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">line</td>
<td class="org-left">线段</td>
<td class="org-left">C-c C-a l</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">proy line</td>
<td class="org-left">直线</td>
<td class="org-left">C-c C-a p</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">四边形</td>
<td class="org-left">rectngle</td>
<td class="org-left">C-c C-a r</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">正方形</td>
<td class="org-left">squares</td>
<td class="org-left">C-c C-a s</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">椭圆</td>
<td class="org-left">elipse</td>
<td class="org-left">C-c C-a e</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">圆</td>
<td class="org-left">circle</td>
<td class="org-left">C-c C-a c</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">水雾</td>
<td class="org-left">spray</td>
<td class="org-left">C-c C-a S</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">开始绘图</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-@</td>
<td class="org-left">自定义按键</td>
</tr>
</tbody>
</table></li>
<li><p>
改键(Hydra-mode)后快捷键 C-@
</p>
<pre class="example">
强推Hydra-mode用来改建

</pre>
<pre class="example">
(require 'artist)
(defhydra hydra-artist-mode (:color blue
:hint nil)
"
_o_: 起点,终点
_l_: 线      _p_: 直线
_r_: 四边形  _s_: 正方形
_e_: 椭圆    _c_: 圆
_y_: 水雾
"
("o" artist-key-set-point)

("l" artist-select-op-line)
("p" artist-select-op-poly-line)

("r" artist-select-op-rectangle)
("s" artist-select-op-square)

("e" artist-select-op-ellipse)
("c" artist-select-op-circle)

("y" artist-select-op-spray-can))
(global-set-key (kbd "C-@")  'hydra-artist-mode/body)
</pre></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org5b8cc5d" class="outline-2">
<h2 id="org5b8cc5d"><span class="section-number-2">4</span> graphviz-mode</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org1e8c9c0" class="outline-3">
<h3 id="org1e8c9c0"><span class="section-number-3">4.1</span> 配置</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li><p>
Emacs安装graphviz-dot-mode 
</p>
<pre class="example">
package-list-packages

</pre></li>
<li><p>
操作系统安装graphviz
</p>
<pre class="example">
mac下安装 brew install graphviz

</pre></li>
</ol>
</div>
</div>
<div id="outline-container-org3b2919e" class="outline-3">
<h3 id="org3b2919e"><span class="section-number-3">4.2</span> 使用</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li>创建.dot (或者org)文件</li>
<li>输入"The DOT Language"代码</li>
<li>输入命令: graphviz-dot-preview即可查看到图片</li>
</ol>
</div>
</div>
<div id="outline-container-org9ef89cd" class="outline-3">
<h3 id="org9ef89cd"><span class="section-number-3">4.3</span> The DOT Language</h3>
<div class="outline-text-3" id="text-4-3">
<p>
<a href="http://users.skynet.be/ppareit/projects/graphviz-dot-mode/graphviz-dot-mode.html">官方文档</a>
<a href="https://blog.csdn.net/sd10086/article/details/52979462">语法参考文档</a>
</p>

<p>
DOT中使用图(digraph/graph), 节点(node)和边(edge)来描述关系和流程图.
</p>
</div>
<div id="outline-container-org7ef7a70" class="outline-4">
<h4 id="org7ef7a70"><span class="section-number-4">4.3.1</span> 图</h4>
<div class="outline-text-4" id="text-4-3-1">
<ul class="org-ul">
<li>有向图 digraph</li>
<li>无向图 graph</li>
<li><p>
子图 subgraph
</p>
<pre class="example">
可以进行和“父图”类似的设置，唯一注意的是子图必须以cluster做为名称的前缀

</pre></li>
</ul>

<p>
在图的开头使用graph []对图进行设置，如：graph [bgcolor="gray"]将图背景色设置为灰色。
属性设置语句也可以不包含在graph []中而直接使用。
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">属性名称</th>
<th scope="col" class="org-left">默认值</th>
<th scope="col" class="org-left">含义</th>
<th scope="col" class="org-left">备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">color</td>
<td class="org-left">black</td>
<td class="org-left">颜色</td>
<td class="org-left">支持如red和#FF00000两种形式</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">fontcolor</td>
<td class="org-left">black</td>
<td class="org-left">文本颜色</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">fontsiez</td>
<td class="org-left">14</td>
<td class="org-left">字体大小</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">label</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">显示的标签</td>
<td class="org-left">对于节点, 默认为节点名称</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">style</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">样式</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">bgcolor</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">背景颜色</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">nodesep</td>
<td class="org-left">.25</td>
<td class="org-left">节点间隔(英寸)</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">rank</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">节点顺序</td>
<td class="org-left">same, min, source, max, sink</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">rankdir</td>
<td class="org-left">TB</td>
<td class="org-left">排序方向</td>
<td class="org-left">TB(top-&gt;bottom)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">size</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">图的大小</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">labelloc</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">调整图或子图的 标签的上下位置</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">labeljust</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">调整图或子图的 标签的左右位置</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orge918467" class="outline-4">
<h4 id="orge918467"><span class="section-number-4">4.3.2</span> 节点</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
DOT中，节点可以不用声明直接使用，但如果需要设置节点的属性，则需声明节点并在声明处设
置属性然后再使用。每个节点首次出现的名称做为该节点的唯一标识
</p>

<p>
node []用于设置节点默认属性（对设置位置之后的点有效），在节点后面用[]设置单独一个点的属性。
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">属性名称</th>
<th scope="col" class="org-left">默认值</th>
<th scope="col" class="org-left">含义</th>
<th scope="col" class="org-left">备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">color</td>
<td class="org-left">black</td>
<td class="org-left">颜色</td>
<td class="org-left">支持如red和#FF00000两种形式</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">fontcolor</td>
<td class="org-left">black</td>
<td class="org-left">文本颜色</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">fontsiez</td>
<td class="org-left">14</td>
<td class="org-left">字体大小</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">label</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">显示的标签</td>
<td class="org-left">对于节点, 默认为节点名称</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">style</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">样式</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">shape</td>
<td class="org-left">ellipse</td>
<td class="org-left">节点形状</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">fillcolor</td>
<td class="org-left">lightgrey/black</td>
<td class="org-left">节点填充颜色</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">fixedsize</td>
<td class="org-left">false</td>
<td class="org-left">标签是否影响节点大小</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org84db21e" class="outline-4">
<h4 id="org84db21e"><span class="section-number-4">4.3.3</span> 边</h4>
<div class="outline-text-4" id="text-4-3-3">
<p>
DOT中有有向边（使用-&gt;表示）和无向边（使用&#x2013;表示）两种，有向边用于有向图，无向边用于无向图，不可混用。
</p>

<p>
和节点类似的，用edge []设置边默认属性，在边之后用[]设置单独一条边的属性。
对于有向边，还可以设置边的起点/终点的位置（用n、e、s、w或它们的组合表示位置）。
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">属性名称</th>
<th scope="col" class="org-left">默认值</th>
<th scope="col" class="org-left">含义</th>
<th scope="col" class="org-left">备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">color</td>
<td class="org-left">black</td>
<td class="org-left">颜色</td>
<td class="org-left">支持如red和#FF00000两种形式</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">fontcolor</td>
<td class="org-left">black</td>
<td class="org-left">文本颜色</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">fontsiez</td>
<td class="org-left">14</td>
<td class="org-left">字体大小</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">label</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">显示的标签</td>
<td class="org-left">对于节点, 默认为节点名称</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">style</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">样式</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">arrowhead</td>
<td class="org-left">normal</td>
<td class="org-left">箭头头部形状</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">arrowtail</td>
<td class="org-left">normal</td>
<td class="org-left">箭头尾部形状</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">constraint</td>
<td class="org-left">ture</td>
<td class="org-left">是否根据边来影响节点的排序</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">decorate</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">设置之后会用一条线来连接edge和label</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">dir</td>
<td class="org-left">forward</td>
<td class="org-left">边的设置方向</td>
<td class="org-left">forward,bcak,both,none</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">headlabel</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">边的头部显示的标签</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">taillabel</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">边的尾部显示的标签</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-09-30 Thu 23:09</p>
<p class="validation"></p>
</div>
</body>
</html>
